Функция ВКМ_ОтправитьСообщениеВТелеграм(ТекстСообщения) Экспорт

    // Константы для хранения данных
    ТокенБота = Константы.ВКМ_ТокенУправления.Получить(); // Ваш токен бота
    ИдентификаторЧата = Константы.ВКМ_ИдентификаторГруппыОповещения.Получить(); // Идентификатор чата или группы
    
    // Создание объекта HTTP-соединения
    HTTPСоединение = Новый HTTPСоединение("api.telegram.org", 443, "", "", , Истина); // Истина для защищённого соединения (HTTPS)
    
    // Формирование URL для запроса
    URL = "/bot" + ТокенБота + "/sendMessage";
    
    // Подготовка структуры с данными для отправки
    ДанныеДляОтправки = Новый Структура;
    ДанныеДляОтправки.Вставить("chat_id", ИдентификаторЧата);
    ДанныеДляОтправки.Вставить("text", ТекстСообщения);
    
    // Преобразование структуры в JSON строку
    JSONСтрока = ВКМ_JSONСтрокаОбъекта(ДанныеДляОтправки);
    
    // Создание HTTP-запроса
    HTTPЗапрос = Новый HTTPЗапрос(URL);
    HTTPЗапрос.УстановитьТелоИзСтроки(JSONСтрока, КодировкаТекста.UTF8);
    
    // Установка заголовков
    HTTPЗапрос.Заголовки.Вставить("Content-Type", "application/json");
    
    // Выполнение запроса
    Попытка
        HTTPОтвет = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);
        
        // Проверка кода состояния ответа
        Если HTTPОтвет.КодСостояния <> 200 Тогда
            // Получение тела ответа как строки
            ТелоОтвета = HTTPОтвет.ПолучитьТелоКакСтроку();
            
            // Запись информации об ошибке в журнал регистрации
			ЗаписьЖурналаРегистрации("Ошибка при отправке сообщения в Telegram",
			УровеньЖурналаРегистрации.Ошибка,
			,ТелоОтвета);
			
		КонецЕсли; 
		Возврат HTTPОтвет.КодСостояния;
    Исключение
        // Обработка исключений 
		ЗаписьЖурналаРегистрации("Ошибка при выполнении HTTP-запроса к Telegram API",
			УровеньЖурналаРегистрации.Ошибка,
			,ОписаниеОшибки());
    КонецПопытки;

КонецФункции

// Вспомогательная функция для преобразования структуры в JSON строку
Функция ВКМ_JSONСтрокаОбъекта(Объект) Экспорт  
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON,Объект);
	ТелоJSON =  ЗаписьJSON.Закрыть();
    Возврат ТелоJSON;
КонецФункции

Процедура ВКМ_ОтправкаСообщенийВТелеграм() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_УведомленияТелеграмБоту.ВКМ_Текст КАК ТекстСообщения,
		|	ВКМ_УведомленияТелеграмБоту.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ВКМ_УведомленияТелеграмБоту КАК ВКМ_УведомленияТелеграмБоту";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		HTTPОтвет = ВКМ_ОтправитьСообщениеВТелеграм(ВыборкаДетальныеЗаписи.ТекстСообщения);
		Если HTTPОтвет = 200 Тогда
			УведомлениеОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
			УведомлениеОбъект.Удалить();
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры
