
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)  
	АдресОтпусковВХранилище = Параметры.АдресОтпусковВХранилище;
	ТАбЗнач = ПолучитьИзВременногоХранилища(АдресОтпусковВХранилище);
	Для каждого стр из ТАбЗнач Цикл
		
		Точка = ДиаграммаГанта.УстановитьТочку(стр.Сотрудник);
		Серия = ДиаграммаГанта.УстановитьСерию(Формат(Параметры.Год,"ДФ=yyyy"));
		Значение = ДиаграммаГанта.ПолучитьЗначение(Точка,Серия);
		
		Интервал = Значение.Добавить();
		Интервал.Начало = стр.ДатаНачала;
		Интервал.Конец = стр.ДатаОкончания;

	КонецЦикла;	
КонецПроцедуры
