
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Для каждого строка из СписокСотрудников Цикл   
		Движение = Движения.ВКМ_ДополнительныеНачисления.Добавить();
		Движение.ПериодРегистрации = Дата;
		Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.Премия;
		Движение.Сотрудник = строка.Сотрудник;
		Движение.Результат = строка.СуммаПремии; 
		Движение.БазовыйПериодНачало = НачалоМесяца(Дата);
		Движение.БазовыйПериодКонец =  КонецМесяца(Дата);
		
		Движение = Движения.ВКМ_Удержания.Добавить();
		Движение.ПериодРегистрации = Дата;
		Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.НДФЛ;
		Движение.Сотрудник = строка.Сотрудник;
		Движение.Результат = строка.СуммаПремии * 13 / 100;
		
		Если строка.Сотрудник.ВКМ_КатегорияСотрудника = Перечисления.ВКМ_КатегорииСотрудников.Специалист Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.Сотрудник КАК Сотрудник,
			|	ЕСТЬNULL(ВКМ_УсловияОплатыСотрудниковСрезПоследних.ПроцентОтРабот, 0) КАК ПроцентОтРабот
			|ИЗ
			|	РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(&Период, Сотрудник = &Сотрудник) КАК ВКМ_УсловияОплатыСотрудниковСрезПоследних";
			
			Запрос.УстановитьПараметр("Период", Дата);
			Запрос.УстановитьПараметр("Сотрудник", строка.Сотрудник);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			Если ВыборкаДетальныеЗаписи.Следующий() Тогда
				ПроцентОтРабот = ВыборкаДетальныеЗаписи.ПроцентОтРабот; 
			Иначе
            	ПроцентОтРабот	= 0;
			КонецЕсли;	
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			               |	СУММА(ЕСТЬNULL(Продажи.Сумма, 0)) КАК Сумма,
			               |	Продажи.Регистратор.Ответственный КАК РегистраторОтветственный
			               |ИЗ
			               |	РегистрНакопления.Продажи КАК Продажи
			               |ГДЕ
			               |	МЕСЯЦ(Продажи.Период) = &Период
			               |	И Продажи.Регистратор.Ответственный = &Ответственный
			               |
			               |СГРУППИРОВАТЬ ПО
			               |	Продажи.Регистратор.Ответственный"; 
			Запрос.УстановитьПараметр("Период", Месяц(Дата));
			Запрос.УстановитьПараметр("Ответственный", строка.Сотрудник);
            ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
			Если ВыборкаДетальныеЗаписи.Следующий() Тогда
				СуммаПродаж = ВыборкаДетальныеЗаписи.Сумма;
			Иначе
				СуммаПродаж = 0;
			КонецЕсли;     
			
			СуммаПродажСпроцентами = СуммаПродаж * ПроцентОтРабот / 100; 
			Если СуммаПродажСпроцентами <> 0 Тогда
				Движение = Движения.ВКМ_ДополнительныеНачисления.Добавить();
				Движение.ПериодРегистрации = Дата;
				Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.ПроцентОтЗаказов;
				Движение.Сотрудник = строка.Сотрудник;
				Движение.Результат = СуммаПродажСпроцентами;
				Движение.БазовыйПериодНачало = НачалоМесяца(Дата);
				Движение.БазовыйПериодКонец =  КонецМесяца(Дата);
				
				
				Движение = Движения.ВКМ_Удержания.Добавить();
				Движение.ПериодРегистрации = Дата;
				Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.НДФЛ;
				Движение.Сотрудник = строка.Сотрудник;
				Движение.Результат = СуммаПродажСпроцентами * 13 / 100;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	Движения.ВКМ_ДополнительныеНачисления.Записать();
	Движения.ВКМ_Удержания.Записать(); 
	
	СформироватьДвиженияВзаиморасчетов();
КонецПроцедуры     

Процедура СформироватьДвиженияВзаиморасчетов()  
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_ДополнительныеНачисления.Сотрудник КАК Сотрудник,
		|	СУММА(ВКМ_ДополнительныеНачисления.Результат - ВКМ_Удержания.Результат) КАК СуммаКВыплате
		|ИЗ
		|	РегистрРасчета.ВКМ_ДополнительныеНачисления КАК ВКМ_ДополнительныеНачисления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ВКМ_Удержания КАК ВКМ_Удержания
		|		ПО ВКМ_ДополнительныеНачисления.Регистратор = ВКМ_Удержания.Регистратор
		|			И ВКМ_ДополнительныеНачисления.Сотрудник = ВКМ_Удержания.Сотрудник
		|
		|СГРУППИРОВАТЬ ПО
		|	ВКМ_ДополнительныеНачисления.Сотрудник";
	
	Запрос.УстановитьПараметр("Регистратор", Ссылка);	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Движение = 	Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();  
		Движение.Период = Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Сотрудник = ВыборкаДетальныеЗаписи.Сотрудник;
		Движение.Сумма = ВыборкаДетальныеЗаписи.СуммаКВыплате;
	КонецЦикла; 
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записать();

КонецПроцедуры

