

&НаКлиенте
Процедура ВКМ_ВидДоговораОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)
	Если ВыбранноеЗначение = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание") Тогда
		Элементы.ВКМ_ДатаНачалаДействия.Видимость = истина;
		Элементы.ВКМ_ДатаОкончанияДействия.Видимость = истина;
		Элементы.ВКМ_СтоимостьЧаса.Видимость = истина;
		Элементы.ВКМ_СуммаАбонентскойПлаты.Видимость = истина;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание") Тогда
		Элементы.ВКМ_ДатаНачалаДействия.Видимость = истина;
		Элементы.ВКМ_ДатаОкончанияДействия.Видимость = истина;
		Элементы.ВКМ_СтоимостьЧаса.Видимость = истина;
		Элементы.ВКМ_СуммаАбонентскойПлаты.Видимость = истина;
	КонецЕсли
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание") Тогда
		Элементы.ВКМ_ДатаНачалаДействия.Видимость = истина;
		Элементы.ВКМ_ДатаОкончанияДействия.Видимость = истина;
		Элементы.ВКМ_СтоимостьЧаса.Видимость = истина;
		Элементы.ВКМ_СуммаАбонентскойПлаты.Видимость = истина;
	КонецЕсли
КонецПроцедуры
